{   
    "about":{
        "name":"HYEJIN IM",
        "title":"✨ UX Designer",
        "title2":"<br>📚 Graduate Research Assistant",
        "photo":"assets/profile.png",
        "desc":"Based in <strong>Boston</strong> with experience in delivering <strong>end-to-end UX/UI design</strong> for digital products. I'm passionate about improving the lives of others through technology and am constantly looking to learn new things everyday. I love <strong>design, coding, and HCI</strong>.",
        "desc2":"Working at <strong>Tufts Center for Engineering Education and Outreach (CEEO) </strong>, being advised by Prof. Chris Rogers. My studies and work are partially supported by scholarships from <strong>LEGO Foundation</strong>.",
        "email": "hyejinim17@gmail.com",
        "address": "",
        "resume": "https://drive.google.com/file/d/17yPNy6cSE-3l3vAXcbhz4xvVWO9yzHYN/view?usp=sharing",
        "twitter":"https://twitter.com/hyecoo",
        "linkedin":"https://www.linkedin.com/in/hyejin-im/",
        "github":"https://github.com/namwkim"
    },
    "news":[
        {
            "title":"Our Draw2Code paper is accepted to the IDC conference",
            "date": "May, 2021"
        },
        {
            "title":"Defended my master's thesis, Draw2Code: low-cost tangible programming for young children to create AR animations!",
            "date": "Apr, 2021"
        },
        {
            "title":"Awarded for Tufts Graduate Student Research Competition",
            "date": "Feb, 2021"
        },
        {
            "title":"Leading a Draw2Code workshop at PLAYfest 2021",
            "date": "Jan, 2021"
        },
        {
            "title":"Giving a talk on usability heuristics for user interface design for CEEO Summer interns",
            "date": "Aug, 2020"
        },
        {
            "title":"Selected by LEGO Ventures for in-person mentorship at the LEGO headquarter in Denmark (Canceled due to the COVID pandamic)",
            "date": "Aug, 2020"
        },
        {
            "title":"Awarded a best teamwork prize by Tufts Ventures Accelerator",
            "date": "Aug, 2020"
        }
    ],
    "projects":[
        {
            "id":"draw2code",
            "title": "DRAW2CODE",
            "role": "Lit Review, Concept Development, Design, Developlemnt, User Study, Data Analysis",
            "type": "Self-Directed Project<br>Master's Thesis, <br> Advised by Prof. Chris Rogers",
            "product": "Tangible Kit, Web-Based Mobile Application",
            "tools": "Figma, Miro, Qualtrics, Tableau, NVivo, Javascript, p5.js, Teachable Machine",
            "award": "🏆 Awarded for Graduate Research Competition",
            "subtitle": "📱 Creating a paper-based AR kit to engage young children in a playful coding environment to develop computational thinking",
            "teaser": "assets/draw2code/teaser.png",
            "tags":["UX/UI", "Concept", "Research", "Development", "Featured"],
            "video": "assets/draw2code/draw2code-tutorial.mp4",
            "rq": "How might we develop a computational kit that increases young children’s participation in computing, especially children from underrepresented groups in STEM?",
            "desc": "Draw2Code is a <strong>paper-based computational kit </strong>that provides playful coding environment for young children to create an <strong>interactive AR animation</strong>. Children use Draw2Code to make their paper drawing alive as an animated virtual sprite and control it using hand gestures. It exposes children to basic programming concepts through tangible interaction. <br><br> This work is awarded a winner for Graduate Student Research Competition by Tufts GSAS and presented at the IDC 2021 Conference and the PLAYfest 2021. <br><br><i><strong>Im, H.</strong>, Rogers, C. Draw2Code: Low-Cost Tangible Programming for Creating AR Animations. In proceedings of Interaction Design and Children Conference 2021.</i>",
            "next": "steamdiscoverylab",
            "linklabel": "→ SEE THESIS",
            "link": "https://drive.google.com/file/d/19VSQYhYBQMyJ6bVujrVg8ovS3AOEefCk/view?usp=sharing",
            "link2": "https://drive.google.com/file/d/1JW_O21dNBpp3T8bE5ZrRDM6w61Vzob_J/view?usp=sharing",
            "process": [
                {
                    "step": "Background",
                    "image": "assets/draw2code/kits-by-expressivity.png",
                    "caption": "<br><br><i>Investigation of low-cost and expressive tangible interfaces that foster computational literacy</i><br><br>Computational thinking is nowadays considered an essential skill in the K-12 educational curriculum. Many tangible computational kits designed for early childhood are either too expensive to benefit a wide range of children or only provide predetermined challenges with limited creative content creation opportunities."
                },
                { 
                    "step": "Why Young Children?",
                    "image": "",
                    "caption": "<strong>Underrepresented Children in STEM Matters</strong><br>• STEM gender stereotypes emerges in early childhood <br>• Previous coding experience is correlated with self-efficacy toward CS<br>• Children from low-income families do not have equal opportunities <br><br><strong>Opportunities in Tangible Inteface for Computational Thinking</strong><br>While tangible Interface are known as effective for young children's learning, many of them are not accessible to all children since they are expensive. They also constrain to predetermined challenges thus might not be engaging enough for some children.<br><br>"
                },
                { 
                    "step": "Design Goals",
                    "image": "assets/draw2code/design-consideration.png",
                    "caption": "<br><br>The intended audience of Draw2Code is young children of pre-school through early elementary school. In addition to being age-appropriate, intuitive, and attractive, Draw2Code has three design goals: <br><br><strong>1. Supporting tangible programming</strong> that encourages natural interaction and physical movement — We achieve this by allowing users to use <strong>drawing and gesture-based interaction</strong><br><br><strong>2. Using low-cost materials</strong> that can be deployed at home/in classroom settings — We address this by using <strong>pen & paper</strong> and widely available personal <strong>mobile devices </strong>such as cell phones and tablets<br><br><strong>3. Creating open-ended system</strong> in which children can express their creativity and personally meaningful ideas — We tackle this goal by enabling creating <strong>AR animation</strong> using a <strong>physical drawing</strong><br><br>To make the both tangible and virtual interfaces appropriate for young children, we minimized text usage, made buttons big, and made icons straightforward to understand. We also paid attention to involving both boys and girls, such as using colors to which both genders can feel a sense of belonging.<br><br>"
                },
                { 
                    "step": "Draw2Code Interface",
                    "image": "assets/draw2code/overview.png",
                    "caption": "Draw2Code is a paper-based computational kit for young children to create interactive AR animations. The kit consists of two major components: paper coding blocks and a mobile application. Children can author their own animations by manipulating the paper coding blocks and execute the code with a mobile device."
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/block-types.png",
                    "caption": "<i>Paper coding blocks</i> "
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/mobile-interface.png",
                    "caption": "<i>Mobile web application</i><br><br>"
                },
                { 
                    "step": "Coding/Interaction Workflow",
                    "image": "assets/draw2code/workflow.png",
                    "caption": "<br><br>"
                },
                { 
                    "step": "Implementation",
                    "image": "assets/draw2code/flowchart.png",
                    "caption": "<br><br>We designed paper coding blocks that can be easily fabricated by printing and cutting out and developed a web application written in Javascript. We used p5.js library for building user interface components. We leveraged Teachable Machine to create image classification models to detect different coding blocks and hand gestures from images. We made image processing algorithms to parse the block images to data and control variables using computer vision techniques. We used a camera embedded in a mobile device to capture images.<br><br>"
                },
                { 
                    "step": "Use Case Scenarios",
                    "image": "assets/draw2code/object.png",
                    "caption": "<br><br><i>Customizing sprites</i><br><br>"
                },
              
                { 
                    "step": "User Study",
                    "image": "assets/draw2code/testing.png",
                    "caption": "We conducted a user study with nine child-parent dyads (children ages 5 to 12) to evaluate the usability of the kit. Results from our initial evaluation revealed that all children easily prepared Draw2Code at home with help from the parents and without extra cost."
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/task-results.png",
                    "caption": "<br><br><i>Task Success Rate and Free Play Length</i><br><br>The task success rate shows that all children successfully used Draw2Code without direct help from the researcher. Children showed high level of engagement in playing with Draw2Code regardless of age and gender. The results of free play task indicates that children played with it for 33 minutes on average (Min: 20, Max: 45)."
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/survey-results.png",
                    "caption": "<br><br><i>Survey Results</i><br><br>The children each created at least two and as many as five different AR animations based on their ideas. Throughout the sessions, all children were engaged in computational thinking concepts and practices including decomposition, abstraction, and algorithms. Most children mentioned they particularly liked the moment when their drawing came to life on the AR screen. They also liked intuitive drawing and gesture-based interactions to code for and control their program."
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/children-code.png",
                    "caption": "<br><br><i>Artifacts of the code children generated: (a) a bee flying, (b) a blowing up effect getting bigger to the full-screen size, (c) a whale swimming, (d) an ice cream splitting into two pieces.</i>"
                },
                { 
                    "step": "",
                    "image": "assets/draw2code/children-outcome.png",
                    "caption": "<i>Artifacts of the diverse AR animations with stories children created: (a) a truck is blowing up, (b) a creepy monster living in a forest is chasing and attacking a child, (c) a bee is coming close to a child's face and she is trying to dodge, (d) a child is showing her fist and a mouse is moving around on a green meadow, (e) an anger cloud is appearing over a child's head, (f) a little himself of a child is jumping on the snow.</i>"
                }
            ],
            "images": [
                { 
                    "image": "assets/draw2code/coding-blocks.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-01.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-02.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-03.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-04.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-05.png",
                    "caption": ""
                },
                { 
                    "image": "assets/draw2code/draw2code-06.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
               
            ],
            "reflection": [
                { 
                    "title": "Joy of Implementing an Idea from Scratch",
                    "desc": ""
                },
                { 
                    "title": "Testing Early, Testing Often to Validate with Users",
                    "desc": ""
                }
            ]
        },
        {
            "id":"steamdiscoverylab",
            "title": "STEAM DISCOVERY LAB",
            "role": "UX/UI Design, Graphic Design, Illustration",
            "type": "Individual Work<br>Tufts CEEO Summer Internship",
            "product": "Responsive Website",
            "tools": "Post-it, Figma, Weebly, Javascript",
            "subtitle": "🖥️ Redesigning an online community for K-12 STEAM educators",
            "teaser": "assets/steamdiscoverylab/teaser-hand6.jpeg",
            "tags":["UX/UI", "Illustration"],
            "video": "assets/steamdiscoverylab/video.mp4",
            "rq": "How might we increase content discoverability and user engagement on the website?",
            "desc": "The STEAM (Science, Technology, Engineering, Art, and Math) Discovery Lab is one of Tufts Center for Engineering Education and Outreach (CEEO) research projects. The goal of the STEAM Discovery Lab is to provide educators with new and exciting <strong>ideas and resources for conducting hands-on activities</strong> in their classroom. <br><br>Over 10-week summer internship, I was responsible for redesining the website to improve user experience and make it more user-friendly. I focused on identifying primary user scenarios and existing usability issues. Based on that, I redesigned information architecture, user flow, and user interface.",
            "next": "speakgo",
            "linklabel": "→ VISIT WEBSITE",
            "link": "https://www.steamdiscoverylab.com/",
            "process": [
                { 
                    "step": "Background",
                    "image": "assets/steamdiscoverylab/poster.png",
                    "caption": "<i>As-Is</i>",
                    "info": "• Not obvious site users, goals, do not look professional (Trustworthy) • Hard to navigate site • Inconsistent content: As multiple authors (students and staff at the center) had been creating a lot of different types of content, the original navigation and website structure were not optimized for the current content. Also, the content produced by different authors was not always consistent. It made users harder to find content easily and effectively on the website as well as to visit the website again."
                },
                { 
                    "step": "Conducting Usability Inspection",
                    "image": "assets/steamdiscoverylab/heuristic-evaluation.png",
                    "caption": "<i>Heuristic Evaluation</i>"
                },
                { 
                    "step": "",
                    "image": "assets/steamdiscoverylab/grouped-content.png",
                    "caption": "<i>Information Architecture Analysis</i>",
                    "info": " <br><br> User Testing (Let them freely explore websites and asked overall impression. Think Aloud and Breif Interview) <br>• I do not know what to start with this website <br>• It is hard to imagine where a specific content will be and it requires so many clicks <br>• It looks like it is designed for elementary school students <br> • Content and pages are not consistent and it looks like not professional and credible resources"
                },
                { 
                    "step": "Design Goals",
                    "image": "",
                    "caption": "• Welcoming and usable home page: Providing optimized look and feel and information on how to use the website  <br>• Straightforward navigation: Make it easy to find content and reduce page depth <br>• Consistent layout and user flow",
                    "info": ""
                },
                { 
                    "step": "Emphasizing Potential Primary Users",
                    "image": "assets/steamdiscoverylab/persona.png",
                    "caption": "",
                    "info": "To reasonate design decision, persuade, on the same page with other members. Imaginary persona, user journey map, use case scenarios. The website provides teachers with inspiring lesson plans and activity ideas that they can tweak to best meet the needs of their students and subject area. The site also features activity ideas that combine different technologies in unconventional ways."
                },
                { 
                    "step": "Redesigning the Website",
                    "image": "assets/steamdiscoverylab/steam-structure.png",
                    "caption": "",
                    "info": "IA and User flow - Narrow to shallow, Reorganized information architecture and created content Metadata for each content. They grouped by content type, category, and tags"
                },
                { 
                    "step": "",
                    "image": "assets/steamdiscoverylab/grouping-project.png",
                    "caption": "",
                    "info": "Organize content meta data"
                },
                { 
                    "step": "",
                    "image": "assets/steamdiscoverylab/sketch.png",
                    "caption": "",
                    "info": "Sketch"
                },
                { 
                    "step": "Impact",
                    "image": "",
                    "caption": "",
                    "caption": "The redesigned website was launched in August 2019. A demo session conducted after website redesign proved that the new site was a success; task success rate increased to 100%. The amount of time it took for users to find information significantly decreased. The website returning visitor rate also increased."
                }
            ],
            "images": [
                { 
                    "image": "assets/steamdiscoverylab/teaser2.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
                { 
                    "image": "assets/steamdiscoverylab/home.gif",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/steamdiscoverylab/projects.gif",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/steamdiscoverylab/tools.gif",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/steamdiscoverylab/tools-detail.gif",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/steamdiscoverylab/resources.gif",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/steamdiscoverylab/logo.png",
                    "caption": ""
                },
                { 
                    "image": "assets/steamdiscoverylab/illustration.png",
                    "caption": ""
                }
            ],
            "reflection": [
                { 
                    "title": "Desining for Sustainability and Scalability",
                    "desc": "Not just pretty but thinking about the cycle, as the product content grows, what changes required? from long-term perspective."
                },
                { 
                    "title": "Importance of Consistency in Design",
                    "desc": "To make create user experience. is the Key of Making High-Quality Products. how to support authors to create consistent content acrouss the all products? across all pages? design system. Consistent user interfaces facilitate communication. Use visual consistency to prioritize content, make it navigable, or highlight important bits of it. By using consistency to create a logical structure and to clearly define where users can find what, you'll spare yourself confused and frustrated users."
                }

            ]
        },
        {
            "id":"speakgo",
            "title": "SPEAK GO",
            "role": "Concept Development, UX/UI Design, Development",
            "type": "Team Project <br>CS86: Object-Oriented Programming for Graphical User Interface",
            "product": "Web Application",
            "tools": "HTML, Javascript, CSS, Web Speech API, Procreate",
            "subtitle": "🎮 Developing a voice-controlled game that enhances learning and memorizing",
            "teaser": "assets/speakgo/kid.png",
            "tags":["Development", "UX/UI", "Concept"],
            "video": "assets/speakgo/video.mp4",
            "rq": "How might we leverage voice user interfaces to create playful learning environment?",
            "desc": "Speak Go is a speech game that enhances memorizing with playful and engaging learning. It is a web application written in Javascript. It is a game with a voice controlled interface. We implemented Web Speech API. <br><br> As a member of a small team (two people), we worked together on from developing the concept of the game to developing the user interface.",
            "next": "dataselfie",
            "linklabel": "→ PLAY IT (ON CHROME)",
            "link": "https://hyejinim.github.io/speakgo/",
            "process": [
                { 
                    "step": "Background",
                    "image": "assets/speakgo/speech-recognition.png",
                    "caption": "One of the programming assignments in the Object-Oriented Programming for GUI course was to create an useful user interface using an web API. We wanted to use voice wep speech API and make an educational application that engage users in learning."
                },
                { 
                    "step": "Voice + Gamificiation",
                    "image": "assets/speakgo/chrome-offline-dino-game.jpeg",
                    "caption": "We brainstormed various ideas and decided to create a <strong>voice-controlled game for learning</strong>. We were inspired by Google Chrome's hidden Dinosaur browser game (a.k.a. Chrome Dino) that are available when your computer is offline. This game is very simple but fun enough. You just need to press the space bar to avoid oncoming obstacles by jumping."
                },
                { 
                    "step": "Speak Go: Memorizing by Speaking",
                    "image": "assets/speakgo/howitworks.png",
                    "caption": "<br><br>Speak Go is similar to the Chrome Dino but beyond its funtionalities by using <strong>voice</strong> to play a game and providing <strong>various obstacles</strong> that require different voice commands to be destroyed. Our application is essentially a memorization game, that has several geometric shapes advance toward the user, requiring the user to say the name of the shape out loud in order to destroy it. "
                },
                { 
                    "step": "",
                    "image": "assets/speakgo/shapes.png",
                    "caption": "<br><br>Our target user pool was <strong>young children</strong>, who struggle with learning <strong>geometric shapes</strong>. With the sense of urgency that the animation induces, it motivates the user to get the names of the shapes right in an entertaining way. Speak Go can be <strong>expanded with different types of obstacles</strong> to learn other subject matters (e.g., country flags to learn country name) and also in another language."
                },
                { 
                    "step": "Character Design",
                    "image": "assets/speakgo/chickpea.png",
                    "caption": "To make the game a little more engaging, we created a cute character, Little Bean, and designed its motion. When it hits an obstacle, it gets pressed."
                }
            ],
            "images": [
                { 
                    "image": "assets/speakgo/kid.png",
                    "caption": ""
                },
                { 
                    "image": "assets/speakgo/expanded-speakgo.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
                { 
                    "image": "assets/speakgo/start.png",
                    "caption": ""
                },
                { 
                    "image": "assets/speakgo/advanced.png",
                    "caption": ""
                },
                { 
                    "image": "assets/speakgo/jump.png",
                    "caption": ""
                },
                { 
                    "image": "assets/speakgo/gameover.png",
                    "caption": ""
                }
               
            ],
            "reflection": [
                
            ]
        },
        {
            "id":"dataselfie",
            "title": "DATA SELFIE",
            "role": "Data Analysis, UX/UI Design",
            "type": "Research Project<br>Collaborated with Nam Wook Kim",
            "product": "Web Application",
            "tools": "Figma, ATLAS.ti",
            "subtitle": "🖍️ Creating a survey tool that empowers people to design personalized visuals to represent their data",
            "teaser": "assets/dataselfie/teaser-mockup2.jpeg",
            "tags":["Visualization", "UX/UI", "Research", "Featured"],
            "video": "https://doc-04-34-docs.googleusercontent.com/docs/securesc/lcmoth8lopeo9tdidfto12ph2tamcqpt/qdtp4ss81smlfitk06mpuj0uehoj3hgi/1625860500000/12084871565804967376/12272201305969183738/1hqJ0TjTspLf2_wEceGboqFQstCVcRE7Z?e=view&authuser=0&nonce=dpl322nou30go&user=12272201305969183738&hash=mdb44gvvpeh8gihqt8oonami4k66jnqq",
            "rq": "How can we enable people to determine the representation of their data?",
            "desc": "DataSelfie is a survey tool that allows any individuals to create a visual vocabulary to represent their personal data. <br><br>Using DataSelfie, you can create a questionnaire to ask questions about qualitative and nuanced aspects of yourself and to design a personalized visualization. <br><br> This work is published in CHI 2019. <br><br> <i>Kim N. W., <strong>Im, H.</strong>, Riche, N. H., Wang, A., Gajos, K. Z., Pfister, H. DataSelfie: Empowering People to Design Personalized Visuals to Represent Their Data. ACM Conference on Human Factors in Computing Systems (CHI) 2019.</i>",
            "next": "storyexplorer",
            "linklabel": "→ VISIT WEBSITE",
            "link": "https://dataselfie.namwkim.org/#/",
            "process": [
                { 
                    "step": "Existing Personal Informatics Systems",
                    "image": "assets/dataselfie/background.png",
                    "caption": "<i>Existing Personal Informatics Systems: Apple Health, Reporter App, UbiFit’08</i><br><br><strong>More Convenient but Less Engaged</strong><br>Many personal informatics systems allow people to collect and manage personal data and reflect more deeply about themselves. The manual approaches for data collection have high data capture burdens, often hindering people from sustaining long-term practices. Automated tracking technology attempts to address this issue by leveraging personal devices embedded with various sensors to remove the need for manual data inputs. However, complete automation of data collection often eliminates additional opportunities for engagement and reflection with personal data.<br><br><strong>Lack of Support for Customizing Visualization</strong><br>Existing self-tracking tools focus on data collection and management, not necessarily on how to display the data. As a result, the design of the tools dictates the presentation of the data, showing data summaries in the form of standard charts or tables. People rarely have a chance to customize their data and have passive ownership of the visuals."
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/bullet-journal.png",
                    "caption": "<br><br><strong>Advantages of Expressive Visuals Using Pen & Paper</strong><br>On the other hand, a lot of people still use pen & paper to create much more expressive representations that can communicate their emotion and personality, as well as the context of the data much better than standard charts."
                },
                { 
                    "step": "Open Coding of 104 Postcards",
                    "image": "assets/dataselfie/deardata.jpeg",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/deardata2.jpeg",
                    "caption": "<i>Stefanie’s Postcard of Week 14, Dear Data</i><br><br>To understand what types of data can capture personal lives and what kinds of visuals can be used to represent the data, we analyzed visualizations and retrospective texts of <strong>104 postcards from the Dear Data project </strong>in which two professional infographic designers, Lupi and Posavec, collected data about themselves and drew custom visualizations with the data every week for a year."
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/analysis.png",
                    "caption": "<i>Themes identified through visual postcards and retrospective text analysis</i>"
                },
                { 
                    "step": "Findings",
                    "image": "",
                    "caption": "While visual postcards revealed common design elements to represent personal data, retrospective texts allowed us to gain insights into the underlying rationale for the design choices and identify different stages of the process.<br><br><strong>Design Elements to Represent Personal Data</strong>"
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/histogram.png",
                    "caption": "<i>A Histogram of Categories Identified through Visual Postcards Analysis</i><br><br><strong>Visual Postcard Design Process</strong>"
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/designprocess.png",
                    "caption": "<i>Five Stages of Process Identified through Retrospective Text Analysis</i>"
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/painpoints.png",
                    "caption": "<i>Painpoints in the Design Process</i>"
                },
                { 
                    "step": "",
                    "image": "",
                    "caption": "<strong>Implications for Personal Informatics</strong><br>1. Capture qualitative aspects of self <br> 2. Reveal missing and uncertain data <br> 3. Provide different modes of data collection <br>4. Support data exploration for story harvesting <br>5. Use visual annotations to encode moments<br>6. Enable designing personalized visuals<br>7. Choose visual variables for personalization<br>8. Leverage visuals as personal documentaries <br>9. Address challenges with qualitative processes<br>10. Support conversations through data"
                },
                { 
                    "step": "Design Goals",
                    "image": "assets/dataselfie/designgoals.png",
                    "caption": "Our design goal was to provide <strong>structured support for novices</strong> to crisply articulate the data they want to collect and visualize."
                },
                { 
                    "step": "DataSelfie",
                    "image": "assets/dataselfie/howitworks.gif",
                    "caption": "<i>The production rule of a visualization in DataSelfie, generating a unique visual for each questionnaire response</i><br><br>We developed DataSelfie, a novel system that allows individuals to<strong> create a questionnaire</strong> to ask questions about qualitative and nuanced aspects of ourselves and to <strong>design a personalized visual vocabulary</strong> to represent the collected data, and <strong>share with others</strong>."
                },
                { 
                    "step": "Interface Design",
                    "image": "assets/dataselfie/teaser3.png",
                    "caption": "DataSelfie consists of three main components: a questionnaire editor and a canvas for drawing visual mappings, an interactive legend, and a response viewer. To assist users with less experience in drawing, especially with a mouse, we support auto-drawing, duplicating a shape across all options in a question, along with the automatic size and color encoding."
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/feature1.png",
                    "caption": "<i>The drawing interface of DataSelfie: !) Drawing canvas, B) Auto-drawing, C) Layer view and selection, D) Emoji tool</i>"
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/feature2.png",
                    "caption": "<i>Automatic encoding support: A) Reusing a shpae, B) Color encoding, C) Size encoding, D) Customization</i>"
                },
                { 
                    "step": "User Study",
                    "image": "assets/dataselfie/questionnaire-examples.png",
                    "caption": "<i>Examples of Questionnaires Created by Participants for Two Usage Scenarios (Left: tracking recurring states over time and Right: capturing a current state)</i><br><br>We conducted a user study with 14 participants to evaluate the usability of DataSelfie as well as its potential for individual and collaborative sensemaking of the data."
                },
                { 
                    "step": "",
                    "image": "assets/dataselfie/visualization-examples.png",
                    "caption": "<i>Examples of Visualization Results Generated by Participants</i><br><br>❝<strong>It allows you to visualize goals and impacts in advance</strong>❞ <br>— P9 <br><br>❝<strong>I like visuals as they invoke more thoughts</strong>❞ <br>— P7<br><br>❝<strong>Freedom to draw anything to represent my data makes it fun and lively</strong>❞ <br>— P13<br><br>❝<strong>It would be good for emotion and well-being that lack clear forms</strong>❞ <br>— P8"
                },
                { 
                    "step": "Actionable Conclusion",
                    "image": "",
                    "caption": "We believe that personal informatics systems that allow custom visualization benefit people to determine the representation of their data."
                }
            ],
            "images": [
                { 
                    "image": "assets/dataselfie/teaser-mockup.jpeg",
                    "caption": ""
                },
                { 
                    "image": "assets/dataselfie/demo.gif",
                    "caption": ""
                }
            ],
            "wrappedimages": [
 		        { 
                    "image": "assets/dataselfie/teaser3.png",
                    "caption": ""
                },
                { 
                    "image": "assets/dataselfie/teaser2.png",
                    "caption": ""
                },
                { 
                    "image": "assets/dataselfie/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/dataselfie/user-demo.jpeg",
                    "caption": ""
                }
            ],
            "reflection": [
                { 
                    "title": "",
                    "desc": ""
                },
                { 
                    "title": "",
                    "desc": ""
                }
            ]
        },
        {
            "id":"storyexplorer",
            "title": "STORY EXPLORER",
            "role": "Visualization, Data Labeling, UX/UI Design",
            "type": "Research Project<br>Collaborated with Nam Wook Kim",
            "product": "Web Application",
            "tools": "Figma",
            "subtitle": "🖥️ Creating a visualization tool for authoring and exploring nonlinear narratives",
            "teaser": "assets/storyexplorer/teaser-mockup1.jpeg",
            "tags":["Visualization", "UX/UI", "Research", "Featured"],
            "video": "assets/storyexplorer/video.mp4",
            "rq": "How can we support people to easily explore and learn about the nonlinear narrative of movies through visualization?",
            "desc": "Story Explorer is an <strong>interactive tool</strong> that visualizes a story curve, a <strong>visualization of the nonlinear narrative of a movie</strong>, together with complementary information such as characters and settings. Story Explorer further provides a <strong>script curation interface </strong>that allows users to specify the chronological order of events in movies. <br><br>As one of the collaborators of this project, I worked on brainstorming and generating visualization sketches to reveal nonlinear narrative patterns in movie scripts, and helped with labeling data and designing user interface of Story Explorer. <br><br>This work is awarded Kantar Information is Beautiful Awards and published in IEEE transactions on visualization and computer graphics (InfoVis'18)<br><br> <i>Kim, N. W., Bach B., <strong>Im, H.</strong>, Schriber, S., Gross M., Pfister, H. Visualizing Nonlinear Narratives with Story Curves. IEEE Transactions on Visualization and Computer Graphics (InfoVis), 2018</i>",
            "next": "donare",
            "linklabel": "→ VISIT WEBSITE",
            "link": "https://storycurve.namwkim.org/",
            "process": [
                { 
                    "step": "Background",
                    "image": "assets/storyexplorer/movies.jpeg",
                    "caption": "<i>10 Popular Nonlinear Movies</i><br><br>A nonlinear narrative is a storytelling device that portrays events of a story out of chronological order (e.g., in reverse order or going back and forth between past and future events). Understanding the wealth of patterns in narratives as well as their respective effects has been an ongoing effort in the humanities and the domains associated with the production of narratives  There are relatively few studies that focus on the temporal aspect of narratives. "
                },
                { 
                    "step": "The Problem",
                    "image": "assets/storyexplorer/atlantic.png",
                    "caption": "<i>Image Credit: Chelsea Beck, The Atlantic</i><br><br>Explicit data about the chronological order of events is typically not available and difficult to infer from the final narratives in film, theater, or video games. The complexity of temporal disorientation makes it not only hard to write a nonlinear narrative but also difficult to understand it. In addition, there are no computational tools that can ease exploration and communication of intricate nonlinear narrative patterns."
                },
                {
                    "step": "Design Goals",
                    "image": "",
                    "caption": "D1. Show events in both narrative and story order<br>D2. Present story metadata to reveal the semantic structure of narrative<br>D3. Let users access and read actual narrative texts"
                },
                { 
                    "step": "Story Curves",
                    "image": "assets/storyexplorer/visualizations.png",
                    "caption": "<i>Story curves (a) compared to design alternatives (b,c) for Pulp Fiction (top) and Memento (bottom).</i><br><br>We brainstormed and tested various visualization techniques with movie scripts. We then came up with Story Curves."
                },
                {
                    "step": "",
                    "image": "assets/storyexplorer/storycurve.png",
                    "caption": "Story Curves visualize the nonlinear narrative of a movie by showing the order in which events are told in the movie and comparing them to their actual chronological order, resulting in possibly meandering visual patterns in the curve. "
                },
                {
                    "step": "Story Explorer Interface Design",
                    "image": "assets/storyexplorer/sketch.png",
                    "caption": "<i>Initial Skektch of Story Explorer</i>"
                },
                {
                    "step": "",
                    "image": "assets/storyexplorer/iteration.png",
                    "caption": "<i>Design Iteration</i>"
                },
                {
                    "step": "",
                    "image": "assets/storyexplorer/storyexplorer.png",
                    "caption": "<i>Overview of Story Explorer with three embedded views: (a) story curve view, (b) script view, and (c) metadata view. The story curve succinctly summarizes the nonlinear narrative of Pulp Fiction with additional metadata displayed along the story curve.</i> <br><br>Story Explorer processes a movie script, extracts story elements (scenes, characters, settings), and visualizes the narrative of the movie alongside the script text. It supports the curation of the chronological order of scenes and enables close reading of the script in both story and narrative order."
                },
                {
                    "step": "Useful Features",
                    "image": "assets/storyexplorer/reconstruction.png",
                    "caption": "<i> Arranging scenes in story order in the script reading interface</i>"
                },
                {
                    "step": "",
                    "image": "assets/storyexplorer/sentiment.png",
                    "caption": "<i>Pulp Fiction’s story curve showing character dialog sentiment; red: negative, gray: neutral, green: positive</i>"
                },
                {
                    "step": "",
                    "image": "assets/storyexplorer/co-occurrence.png",
                    "caption": "<i>Pulp Fiction’s story curve showing the co-occurrence of the two main characters, Jules and Vincent in the morning</i>"
                },
                {
                    "step": "Nonlinear Narrative Patterns with Story Curves",
                    "image": "",
                    "caption": "We created story curves for 10 popular nonlinear narrative movies. We gathered the movie scripts from a public database and manually restored the story order of the scenes in each movie using Story Explorer. We describe the spectrum of narrative patterns that we discovered, including some novel patterns not previously described in the literature. "
                }
            ],
            "images": [
                { 
                    "image": "assets/storyexplorer/teaser-mockup3.jpeg",
                    "caption": ""
                }
            ],
            "wrappedimages": [
                { 
                    "image": "assets/storyexplorer/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/storyexplorer/storyexplorer-08.png",
                    "caption": ""
                },
 		        { 
                    "image": "assets/storyexplorer/storycurves-01.png",
                    "caption": ""
                },
                { 
                    "image": "assets/storyexplorer/storycurves-02.png",
                    "caption": ""
                },
                { 
                    "image": "assets/storyexplorer/storycurves-03.png",
                    "caption": ""
                },
                { 
                    "image": "assets/storyexplorer/storycurves-04.png",
                    "caption": ""
                }
               
            ],
            "reflection": [
                { 
                    "title": "",
                    "desc": ""
                },
                { 
                    "title": "",
                    "desc": ""
                }
            ]
        },
        {
            "id":"donare",
            "title": "DONARE",
            "role": "UX/UI Design, Graphic Design, User Research",
            "type": "Team Project<br>CS171: Human-Conputer Interaction",
            "product": "Mobile Application",
            "tools": "Paper Prototyping, Heuristic Evaluation, Figma, Usability Testing",
            "subtitle": "📱 Designing a mobile app helping people donate to their cause quickly and delightfully",
            "teaser": "assets/donare/donare-hand.png",
            "tags":["UX/UI", "Featured"],
            "video": "assets/donare/video.mp4",
            "rq": "How might we encourage people to donate their items to cause they care about?",
            "desc": "Donare is a mobile application that helps people easily and delightfully donate items to causes they care about. <br><br>I worked in a cross-functional team of five members in the Human-Computer Interaction (HCI) course. Throughout the semester, we designed, developed, and evaluated Donare. As a leading UX designer, I was involved in all phases of the project, from mapping out the problem to delivering final designs.",
            "next": "draw2code",
            "linklabel": "→ LAUNCH PROTOTYPE",
            "link": "",
            "process": [
                { 
                    "step": "The Opportunity",
                    "image": "assets/donare/donare-01.png",
                    "caption": "<br><br><strong>User Side</strong> <br> • Often times, people have the heart to donate but are not aware of which charities are out there <br>• People do not have the time to actively seek charities out <br><br> <strong>Charity Side</strong> <br> • Charities often receive donations that are irrelevant/ unneeded for their cause <br> • Charity organizations need more donations"
                },
                { 
                    "step": "Storyboard",
                    "image": "assets/donare/donare-10.png",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/donare/donare-11.png",
                    "caption": ""
                },
                { 
                    "step": "Conceptual Model",
                    "image": "assets/donare/donare-09.png",
                    "caption": ""
                },
                { 
                    "step": "Low-Fidelity Prototype",
                    "image": "assets/donare/paper.png",
                    "caption": "We created a paper prototype based on the conceptual model and tested it with potential users. Several changes had been made on the user flow and new features are added as we incorporated their feedback into our app design. Heuristic evaluation"
                },
                { 
                    "step": "Wireframe",
                    "image": "assets/donare/donare-12.png",
                    "caption": "Usability testing"
                },
                { 
                    "step": "Key Features",
                    "image": "assets/donare/donare-02.png",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/donare/donare-03.png",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/donare/donare-04.png",
                    "caption": ""
                },
                { 
                    "step": "Main User Flows",
                    "image": "assets/donare/donare-05.png",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/donare/donare-06.png",
                    "caption": ""
                },
                { 
                    "step": "",
                    "image": "assets/donare/donare-07.png",
                    "caption": ""
                },
                { 
                    "step": "Evaluation",
                    "image": "",
                    "caption": "We conducted usability testing with the final version of prototype. User satisfaction improved on all metrics comparing to the first prototype. <br><br>Metrics: <br> • How easy did you find the donation process on a scale from 1 to 5 (5 easiest)?: 4.2 to 4.66 (+.46) <br>• How many times did you not know what to do next?: 2 to 0.66 (-1.34) <br>• How easy was it to use to achieve your goal? (5 easiest): 3.9 to 4.66 (+.76) <br>• Did you like the experience of using the app? (1 to 5): 3.8 to 4.33 (+.53)"
                },
                { 
                    "step": "Three More Features",
                    "image": "assets/donare/features.png",
                    "caption": "<br><br><strong>1. Sharing donation needs with friends</strong> <br> Sometimes, those around you may need what you are trying to donate. With this feature, you could help those around you who you didn't know needed help. <br><br> <strong>2. Thank you messages from recipients</strong> <br>We as humans can only be so altruistic. A thank you from the charities / recipients of the donations would be very rewarding to the users, which would motivate them to utilize our service more. <br><br> <strong>3. Timeline news of liked charities or topics</strong> <br> By providing updates regarding the charities that the user has liked, the user can be continuously engaged, preventing the experience becoming a one-time use."
                }
            ],
            "images": [
                { 
                    "image": "assets/donare/donare-hand.png",
                    "caption": ""
                },
                { 
                    "image": "assets/donare/teaser.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
               
            ],
            "reflection": [
                { 
                    "title": "How to Effectively Work in a Multi-Displinary Team",
                    "desc": "Our team members learned from one another by closely working in every step and actively sharing our knowledge and ideas. I realized that our team culture that we appreciated other's contribution and commitment made all of us motivated."
                }
            ]
        },
{
            "id":"vismorn",
            "title": "VISMORN",
            "role": "Concept Development, UX/UI Design, User Research, Prototype",
            "type": "Individual Work <br>Interaction Design Specialization Capstone Project on Coursera",
            "product": "Mobile Application",
            "tools": "Figma, Framer, UserTesting.com",
            "subtitle": "📱 Reinventing an alarm clock for the habitual snoozers",
            "teaser": "assets/vismorn/teaser-hand.jpeg",
            "tags":["UX/UI", "Concept", "Featured"],
            "video": "assets/vismorn/video.mp4",
            "rq": "How might we help people who constantly use the snooze button easily wake up on time in the morning?",
            "desc": "Vismorn is for people who struggle to wake up on time in the morning. Instead of setting a single time to wake up as other alarm clocks do, Vismorn provides two different times to set up, one for waking up and another for doing following task (e.g., go to work). <br><br>The app focuses on achieving a high-level goal as waking up on time is often only a part of reaching the goal. That is, it emphasizes the time gap between wake-up time and task time to encourage a user to be more aware of the goal when setting the times and hitting the snooze button.",
            "desc2": "We set our alarms for good reason but hit snooze too many times, making the rest of our morning unnecessarily stressful. If you find yourself confronting too many of these self-imposed crises, there are some pretty nifty solutions to force you out of bed. Some alarm clocks simply amp up the aggravation, shaking, squawking, and shining bright lights at habitual snoozers. On these models, of course, there’s no snooze button at all. We recommend placing them out of arm’s reach, so you’ll need to get out of bed to turn them off. Another ingenious solution for habitual snoozers is Ruggie, which looks more or less like a well-cushioned floor matt. To turn off this innovative alarm, you actually need to step on it for three full seconds – and get out of bed in the process. Pros: Kiss the temptation to snooze goodbye and start your mornings on time. Cons: There’s really no middle ground: On the rare occasion where you can snooze responsibly, you’re basically out of luck.",
            "next": "industrialwork",
            "linklabel": "→ VIEW PROTOTYPE",
            "link": "",
            "process": [
                { 
                    "step": "Design Process",
                    "image": "assets/vismorn/design-process.png",
                    "caption": "<strong>1. Needfinding</strong> — Observation, survey, interview<br><strong>2. Ideation</strong> — Inspiration boards, brainstorming, storyboards<br><strong>3. Prototyping</strong> — Paper prototype, wireframe, funtional prototype<br><strong>4. Evaluation</strong> — Heuristic evaluation, usability testing"
                },
                { 
                    "step": "Background",
                    "image": "",
                    "caption": "Are you satisfied with your alarm clock? How can it help you to become a more productive person? Alarm clock is not just for waking you up at a certain time. Starting your morning as you have planned is the key of your success of the day."
                },
                { 
                    "step": "User Research",
                    "image": "",
                    "caption":  "I conducted a survey with 126 people ages 20 through 60. I then conducted a semi-structured in-depth interview with three people to identify their needs and painpoints around using an alarm clock. <br><br> My main research questions were on 1) how people use an alarm clock, 2) their considerations/behaviors to make sure to wake up on time, and 3) the causes they fail to wake up on time."
                },
                { 
                    "step": "Key Findings",
                    "image": "assets/vismorn/survey-results.png",
                    "caption":  "People use an alarm clock not just to wake up in the morning but eventually to not be late at school/work. Participants answered that they are late for various reasons. Major reasons they fail to be on time at work/school were not only due to the failure to wake up on time (61%) but also the failure to leave their home on time (29%). There are four primary causes for that: 1) habitual snooze (53%), 2) missing an ideal time for leaving home (24%) 3) miscalculation of the amount of the time for enough sleep, preparation, and commute time (10%), 4) accidentally not setting up an alarm clock (8%).<br><br> I also learned that people use multiple alarms for different times and use additional methods to make sure to wake up (e.g., analog alarm clock, alarm clock app that forces you to wake up physically, family/friends' help)."
                },
                { 
                    "step": "Design",
                    "image": "assets/vismorn/vismorn-04.png",
                    "caption":  "<i>Storyboards</i><br><br>Based on the findings, I created storyboards. I then brainstormed functionalities and user interface. I came up with two different concepts of alarm clock."
                },
                { 
                    "step": "",
                    "image": "assets/vismorn/vismorn-05.png",
                    "caption":  "<i>Paper prototypes: a chat-bot based alarm clock (left) and an alarm clock showing the duration for sleep and morning preparation</i> <br><br> Focusing on the problem I wanted to solve, I ended up going for the second concept and created a high-fidelity prototype using Framer. "
                },
                { 
                    "step": "",
                    "image": "assets/vismorn/vismorn-07.png",
                    "caption":  "<i>Functional prototype to test out interactions created using Framer</i>"
                },
                { 
                    "step": "User Testing and Iterations",
                    "image": "assets/vismorn/vismorn-08.png",
                    "caption":  "<i>Comparing two different design in a user study session on Usertesting.com</i><br><br> Since the interaction I designed is novel, I tested out different designs with five people. The second option was easier to understand how to interact with the elements as it provides a more make-sense affordance (i.e., arrow to drag up and down). People tend to tap the plus and minus button with the first option which was not an efficient way to do set up the time."
                }
            ],
            "images": [
                { 
                    "image": "assets/vismorn/vismorn-p4.png",
                    "caption": ""
                },
                { 
                    "image": "assets/vismorn/vismorn-p5.png",
                    "caption": ""
                },
                { 
                    "image": "assets/vismorn/vismorn-01.png",
                    "caption": ""
                },
                { 
                    "image": "assets/vismorn/vismorn-03.png",
                    "caption": ""
                },
                { 
                    "image": "assets/vismorn/vismorn-02.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
            ],
            "reflection": [
                { 
                    "title": "Joy of Implementing an Idea from Scratch",
                    "desc": ""
                },
                { 
                    "title": "Testing Early, Testing Often to Validate with Users",
                    "desc": ""
                }
            ]
        }
                
    ],
    "archaived": [
        {
            "id":"tinkering",
            "title": "TINKERING",
            "product": "Web Application, Game, Simulation",
            "role": "UX/UI Design, Game Design, 3D Graphic Design, Development, Making",
            "type": "Self-Directed Project",
            "tools": "Java, Javascript, Three.js, WebGL, 3D Printer, Laser Cutter",
            "subtitle": "🧪 Miscellaneous digital and physical fabrication",
            "teaser": "assets/spacedog/teaser.png",
            "tags":["Development", "Concept"],
            "video": "assets/spacedog/video.mp4",
            "rq": "How can we use technologies to express creativity?",
            "desc": "I beleive that people learn the best when they work on personally interesting or meaningful projects. Whenever I had a chance to learn new technologies or techniques, I tried to make something fun and experimental. These are some of the projects I created as results of learning.",
            "next": "tinkering",
            "linklabel": "→ SEE THESIS",
            "link": "",
            "process": [
                { 
                    "step": "Space Dog",
                    "image": "assets/spacedog/screenshot.png",
                    "caption": "Space Dog is a simulation application of floating dogs in the space. It is a simple and interactive 3D environment and developed using Three.js and WebGL. As the user move his/her mouse position, the movement of dogs and the speed of meteors would change. <br><br> I learned how to design animated 3D objects having multiple parts, how to express different materials, and how to use lights in the 3D world."
                },
                { 
                    "step": "Laika Back To The Earth",
                    "image": "assets/laika/laika-dog.png",
                    "caption": "",
                    "info": ""
                },
                { 
                    "step": "",
                    "image": "assets/laika/teaser3.png",
                    "caption": "Laika Back To The Earth is a 2D simulation game written in Java. It is developed for Laika, a space dog from Soviet Union. In this game, the player plays a role of Laika and saves other dogs in the space and come back home, the Earth. I hoped more peoplae are aware of the behind story of this game: animals' sacrifice and contribution in science. I also wanted to give a positive lesson to players through this game; it does not require fighting and competeting against enemies but helping ohters to achieve the success.<br><br>It has game design and play modes so players can design their own games.",
                    "info": "As a project of space dog series, I developed a game for Laika. can design the game. Imaginary mission. By playing this game, the user can experience a journey of Laika, get interested in the behind story of the dog, and learn a lesson "
                },
                { 
                    "step": "Emoji Safari",
                    "image": "assets/tinkering/emojisafari.png",
                    "caption": "",
                    "info": ""
                },
                { 
                    "step": "",
                    "image": "",
                    "caption": "",
                    "info": "Friendly Monster"
                },
                { 
                    "step": "",
                    "image": "",
                    "caption": "",
                    "info": "Trainable Motors,Training smart motors without programming"
                }
            ],
            "images": [
                { 
                    "image": "",
                    "caption": ""
                }
            ],
            "wrappedimages": [
 		{ 
                    "image": "",
                    "caption": ""
                }
               
            ],
            "reflection": [
                { 
                    "title": "",
                    "desc": ""
                },
                { 
                    "title": "",
                    "desc": ""
                }
            ]
        },
        
        {
            "id":"industrialwork",
            "title": "INDUSTRIAL WORK",
            "type": "Commercial Projects<br>pxd.Inc",
            "role": "UX/UI Design, User Research, Workshop Facilitation",
            "product": "Mobile Applications, Responsive Web Platforms, Home Appliances",
            "tools": "Keynote, Microsoft Powerpoint, HTML, Invision, Diary Study, In-Depth Interview, Survey",
            "subtitle": "📺 Designing UX/UI of mobile applications, responsive web platforms, and home appliance for clients in various industries",
            "teaser": "assets/industrialwork/teaser.png",
            "tags":["UX/UI", "Featured"],
            "video": "assets/industrialwork/video.mp4",
            "rq": "",
            "desc": "In this paper, we present BubbleView, an alternative methodology for eye tracking using discrete mouse clicks to measure which information people consciously choose to examine. BubbleView is a mouse-contingent, moving-window interface in which participants are presented with a series of blurred images and click to reveal 'bubbles' - small, circular areas of the image at original resolution, similar to having a confined area of focus like the eye fovea. Across 10 experiments with 28 different parameter combinations, we evaluated BubbleView on a variety of image types: information visualizations, natural images, static webpages, and graphic designs, and compared the clicks to eye fixations collected with eye-trackers in controlled lab settings. We found that BubbleView clicks can both (i) successfully approximate eye fixations on different images, and (ii) be used to rank image and design elements by importance. BubbleView is designed to collect clicks on static images, and works best for defined tasks such as describing the content of an information visualization or measuring image importance. BubbleView data is cleaner and more consistent than related methodologies that use continuous mouse movements. Our analyses validate the use of mouse-contingent, moving-window methodologies as approximating eye fixations for different image and task types.",
            "next": "tinkering",
            "linklabel": "",
            "link": "",
            "images": [
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "reflection: client-facing projects, ideally in consulting, agency or other business-related services You can explain and sell design decisions to clients and stakeholders"
                }
            ]
        },
        {
            "id":"sheetsite",
            "title": "SHEET-BASED WEBSITE",
            "role": "UX/UI Design, Developlemnt",
            "type": "Individual Work (Tufts CEEO)",
            "product": "Responsive Website",
            "tools": "Figma, Javascript ES6, HTML, CSS",
            "award": "",
            "subtitle": "Creating an editable directory website from Google Sheets",
            "teaser": "assets/sheetsite/emptysheets.png",
            "tags":["UX/UI", "Concept", "Research", "Development", "Featured"],
            "video": "",
            "rq": "How might we help people who do not code easily update and maintain content for a website?",
            "desc": "To help our lab members, people who don't code. no time to set up. easy to keep maintaining. take over.. The system is easy to use and the learning curve is next to nothing. manage a database and website tool all in one simple spreadsheet. Summer interns could setup a site within 30 minutes.  convenient tool to quickly and effectively display content on your website. o need for coding experience, etc. Simply enter your content in a google sheet",
            "next": "steamdiscoverylab",
            "linklabel": "→ LAUNCH PROJECT",
            "link": "https://drive.google.com/file/d/19VSQYhYBQMyJ6bVujrVg8ovS3AOEefCk/view?usp=sharing",
            "materials": [
                { 
                    "label": "Paper",
                    "path": "assets/draw2code/paper.pdf"
                },
                { 
                    "label": "Video",
                    "path": "assets/draw2code/video.mp4"
                },
                { 
                    "label": "Demo",
                    "path": "https://hyejinim.github.io/draw2code/"
                }
            ],
            "process": [
                { 
                    "step": "Research",
                    "image": "assets/making/teaser.png",
                    "caption": "Consider two side users: authors and audiences."
                },
                { 
                    "step": "Design",
                    "image": "assets/making/teaser.png",
                    "caption": "Blah blah blah blah"
                },
                { 
                    "step": "Development",
                    "image": "assets/making/teaser.png",
                    "caption": "Blah blah blah blah"
                },
                { 
                    "step": "Three More Things",
                    "image": "",
                    "caption": "• More Design Templates <br>• Design Customization <br>• "
                }
            ],
            "images": [
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                },
                { 
                    "image": "assets/making/teaser.png",
                    "caption": ""
                }
            ],
            "wrappedimages": [
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "teaser"
                },
                { 
                    "image": "assets/laika/teaser.png",
                    "caption": "teaser"
                }
            ],
            "reflection": [
                { 
                    "title": "Less Instructions, More Automization",
                    "desc": "People do not follow rules. For consistency, force people to follow rules as form. Form follows content. Do not make users work."
                },
                { 
                    "title": "Data triangulation and usability testing",
                    "desc": "I learned how to triangulate data gathered from different research methods and to implement the feedback into our product. Usability testing also provided rich insights that I never thought of, and it was great to see how our platform can be developed further as we go through those phases."
                }
            ]
        },
        {
            "id":"laika",
            "title": "LAIKA",
            "authors": "Individual Work",
            "type": "Desktop Application",
            "tools": "Java",
            "subtitle": "Game interface that gives players freedom to customize their game design",
            "teaser": "assets/laika/teaser.png",
            "tags":["Development", "Concept"],
            "video": "assets/laika/video.mp4",
            "materials": [
                { 
                    "label": "Paper",
                    "path": "assets/datatoon/paper.pdf"
                },
                { 
                    "label": "Video",
                    "path": "assets/datatoon/video.mp4"
                },
                { 
                    "label": "Demo",
                    "path": "https://datatoon.github.io/"
                }
            ],
            "images": [
            ],
            "desc": "Comics are an entertaining and familiar medium for presenting compelling stories about data. However, existing visualization authoring tools do not leverage this expressive medium. In this paper, we seek to incorporate elements of comics into the construction of data-driven stories about dynamic networks. We contribute DataToon, a flexible data comic storyboarding tool that blends analysis and presentation with pen and touch interactions. A storyteller can use DataToon rapidly generate visualization panels, annotate them, and position them within a canvas to produce a visually compelling narrative. In a user study, participants quickly learned to use DataToon for producing data comics."
        },
        {
            "id":"making",
            "title": "TINKERING",
            "authors": "",
            "type": "...",
            "tools": "...",
            "subtitle": "Making, drawing, and shooting",
            "teaser": "assets/making/teaser.png",
            "tags":[],
            "video": "assets/making/video.mp4",
            "materials": [
                { 
                    "label": "Paper",
                    "path": "assets/datatoon/paper.pdf"
                },
                { 
                    "label": "Video",
                    "path": "assets/datatoon/video.mp4"
                },
                { 
                    "label": "Demo",
                    "path": "https://datatoon.github.io/"
                }
            ],
            "desc": "Comics are an entertaining and familiar medium for presenting compelling stories about data. However, existing visualization authoring tools do not leverage this expressive medium. In this paper, we seek to incorporate elements of comics into the construction of data-driven stories about dynamic networks. We contribute DataToon, a flexible data comic storyboarding tool that blends analysis and presentation with pen and touch interactions. A storyteller can use DataToon rapidly generate visualization panels, annotate them, and position them within a canvas to produce a visually compelling narrative. In a user study, participants quickly learned to use DataToon for producing data comics."
        },
        {
            "id":"spacedog",
            "title": "SPACE DOG",
            "authors": "Individual Work",
            "role": "Concept, Design, Development",
            "type": "Web Application",
            "link": "https://hyejinim.github.io/spacedog/",
            "tools": "Javascript, Three.js, WebGL",
            "subtitle": "Interactive 3D graphic simulation of floating dogs in the space",
            "teaser": "assets/spacedog/teaser.png",
            "img1": "assets/spacedog/thumbnail.png",
            "tags":["Development", "Concept"],
            "video": "assets/spacedog/video.mp4",
            "materials": [
                { 
                    "label": "Paper",
                    "path": "assets/datatoon/paper.pdf"
                },
                { 
                    "label": "Video",
                    "path": "assets/datatoon/video.mp4"
                },
                { 
                    "label": "Demo",
                    "path": "https://datatoon.github.io/"
                }
            ],
            "desc": "While I was learning about object-oriented programming, I wanted to create a simple yet interactive 3D environment using Three.js and WebGL. As user moves his/her mouse position, the movement of dogs and the speed of meteors would change. <br><br> Through this project, I learned how to design animated 3D objects having multiple parts, how to express different materials, and how to use lights in the 3D world."
        }
    ]
}